sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
/*
 * Parcial.c
 *
 *  Created on: Jul 21, 2026
 *      Author: Sophia Alejandra Velásquez Fuentes - sovelasquezf@unal.edu.co
 */

#include <stm32f4xx_hal.h>
#include <stm32f4xx_hal_i2c.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>


#define LCD_I2C_ADDR (0x22 << 1)

/*Posiciones de bits según el mapeo del PCF8574*/
#define LCD_RS         0x01		//P0
#define LCD_RW         0x02		//P1 (Se mantiene en 0 para poder escribir)
#define LCD_EN         0x04		//P2 (Comienza a escribir o leer datos)
#define LCD_BACKLIGHT  0x08		//P3 (Se mantiene en 1 para encender)

/*Direcciones base de cada línea (20x4)*/
#define LCD_LINE1  0x00		//Inicio línea A
#define LCD_LINE2  0x40		//Inicio línea B
#define LCD_LINE3  0x14		//Mitad de línea A (0x00 + 20 = 0x14)
#define LCD_LINE4  0x54		//Mitad de línea B (0x40 + 20 = 0x54)

/*Definiciones de RS: distinguen si se envía un comando o un dato al LCD*/
#define LCD_COMANDO  0
#define LCD_DATO     1

/*Contraseña o firma para la inicialización del RTC*/
#define RTC_BACKUP_PSW  1111		//



TIM_HandleTypeDef htim11;				//TIM11 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

ADC_HandleTypeDef hadc1 = {0};		//ADC1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

I2C_HandleTypeDef hi2c1;				//I2C1 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

UART_HandleTypeDef huart2 = {0};		//USART2 handle debe ser global para que stm32f4xx_it.c pueda acceder a el

RTC_HandleTypeDef hrtc;					//RTC handle debe ser global para que stm32f4xx_it.c pueda acceder a el


/*Variables*/
/*Variables usadas para la conversión ADC*/
volatile uint16_t raw_adc_x = 0;		//Almacena el valor de x para la conversión ADC
volatile uint16_t raw_adc_y = 0;		//Almacena el valor de y para la conversión ADC
volatile uint16_t adc_secuence = 0;		//Bandera para la secuencia en la conversión ADC (En 0: Conversión a hacer es x | En 1: Conversión a hacer es y)

/*Variables usadas para la transmisión del display*/
uint8_t lcd_backlight = LCD_BACKLIGHT;		//Controla el estado de la luz de fondo del LCD

/*Mensaje inicial con las indicaciones para la recepción*/
uint8_t init_Msg[] =
"\r\n"
" Parcial - Sophia Velasquez\r\n"
"--------------------------------------------------------------------\r\n"
" Caracteres para la recepción:\r\n"
" 'H': Cambia el MCO1 para mostrar la frecuencia del HSI\r\n"
" 'L': Cambia el MCO1 para mostrar la frecuencia del LSE\r\n"
" 'P': Cambia el MCO1 para mostrar la frecuencia del PLL\r\n"
" 'F': Cambia el formato de la hora (Entre 12h y 24h)\r\n"
" 'C': Cambia la polaridad del display invirtiendo el contraste\r\n"
"--------------------------------------------------------------------\r\n"
"\r\n";

/*Variable usadas para al comunicación serial*/
volatile uint16_t raw_usart = 0;		//Almacena el valor para la comunicación serial
volatile uint8_t usart_done = 0;		//Bandera para la comunicación serial
volatile uint8_t rx_data = 0;			//Almacena el caracter recibido en la recepción

/*Mensaje completo donde se muestran los valores actuales del equipo a medida que se van actualizando*/
uint8_t msg_buffer[256];



/*Prototipo de funciones privadas*/
static void SystemClock_Config(void);
static void gpio_Init(void);
static void tim11_led_ok_Init(void);
static void adc_Init(void);
static void i2c1_display_Init(void);
static void LCD_SendNibble(uint8_t nibble, uint8_t rs);
static void LCD_SendCommand(uint8_t comando);
static void LCD_Init(void);
static void LCD_SetCursor(uint8_t fila, uint8_t columna);
static void LCD_Print(char *texto);
static void usart2_Init(void);
static void rtc_Init(void);
static void rtc_Initial_Setting(void);
static void mco1_Init(void);





int main(void){

	/*Inicialización de los bloques independientes*/
	HAL_Init();					//Inicializa HAL: SysTick, caché, agrupación de prioridades
	SystemClock_Config();		//Configura el árbol de relojes: HSI a 16 MHz y se activa el PLL para trabajr con el procesador a 100 MHz
	gpio_Init();
	tim11_led_ok_Init();
	adc_Init();

	i2c1_display_Init();
	LCD_Init();
	LCD_SetCursor(0,0);
	LCD_Print("Hola Sophia");

	usart2_Init();
	rtc_Init();
	rtc_Initial_Setting();

	mco1_Init();



	/*Transmisión del mensaje inicial (Instrucción con los caracteres específicos a usar)*/
	HAL_UART_Transmit(&huart2, (uint8_t *) init_Msg, strlen((char *) init_Msg), 300);


	while(1){

	}

}


/*Funciones privadas*/

/*
 * SystemClock_Config
 * Usa el oscilador interno HSI a 16 MHz
 * Se configura el PLL a 100 MHz
 */
static void SystemClock_Config(void){

	/*Inicialización de estructuras*/
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /*Habilitar el reloj del periferico de power control*/
    __HAL_RCC_PWR_CLK_ENABLE();

	/*Subir el regulador a Scale 1 (Condición para que la frecuencia del HCLK máxima sea 100 MHz según el datasheet)*/
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	/*Habilitar acceso al dominio de backup (requerido para tocar el LSE y el RTC)*/
	HAL_PWR_EnableBkUpAccess();

    /*HSI ya está encendido al resetear (Confirmar y usarlo) y del LSE para ser usado en MCO1 y el RTC*/
    RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI |		//Oscilador Interno de Alta Velocidad (HSI)
    										RCC_OSCILLATORTYPE_LSE;			//Oscilador Externo de Baja Velocidad (LSE)
    RCC_OscInitStruct.HSIState            = RCC_HSI_ON;						//Encendido del HSI
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;		//Calibración por defecto de fábrica para el HSI
    RCC_OscInitStruct.LSEState  	 	  = RCC_LSE_ON;						//Encendido del LSE

    /*Configuración del PLL a 100 MHz*/
    RCC_OscInitStruct.PLL.PLLState  = RCC_PLL_ON;				//Activación del PLL
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;		//Selecciona el HSI como fuente para el PLL
	RCC_OscInitStruct.PLL.PLLM      = 16;						//Divisor en 16 = 1 MHz
	RCC_OscInitStruct.PLL.PLLN      = 200;						//Multiplicador en 200 = 200 MHz
	RCC_OscInitStruct.PLL.PLLP      = RCC_PLLP_DIV2;			//Divisor en 2 = 100 MHz

    /*Cargando la configuración en los registros FSR del MCU*/
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /*Seleccionar PLL como SYSCLK*/
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_SYSCLK |		//Configuración simultánea de los relojes
                                       RCC_CLOCKTYPE_HCLK   |
                                       RCC_CLOCKTYPE_PCLK1  |
                                       RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;		//Reloj del sistema (SYSCLK) = 100 MHz
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;   			//Divisor del AHB (HCLK) en 1 = 100 MHz
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;     			//Divisor del APB1 (PCLK1) en 2 = 50 MHz
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;     			//Divisor del APB2 (PCLK2) en 1 = 100 MHz

    /*FLASH_LATENCY_3 = three wait states, correcto para 100 MHz*/
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3);

