sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
}

/*
 * LCD_SendNibble
 *
 */
static void LCD_SendNibble(uint8_t nibble, uint8_t rs){

	/*Limpieza de los bytes control: RS, RW, E y BL*/
	uint8_t dato = (nibble & 0xF0) | LCD_BACKLIGHT | rs;		//0xF0 (11110000)

	/*Envío con Enable en 0 (Deja el byte listo en el bus, en reposo)*/
	HAL_I2C_Master_Transmit(&hi2c1, LCD_I2C_ADDR, &dato, 1, 10);		//10 ms como limite de espera

	/*Cambio del Enable a 1 (Pasa a nivel alto, el HD44780 empieza a "mirar" el dato)*/
	dato |= LCD_EN;

	HAL_I2C_Master_Transmit(&hi2c1, LCD_I2C_ADDR, &dato, 1, 10);

	/*Cambio del Enable a 0 (Pasa a nivel bajo, el HD44780 termina de leer el dato)*/
	dato &= ~LCD_EN;
	HAL_I2C_Master_Transmit(&hi2c1, LCD_I2C_ADDR, &dato, 1, 10);

}


/*
 * LCD_SendCommand
 * Traduce un byte completo en 2 llamadas de 4 bits cada una
 * Se trata sobre comandos u ordenes a seguir
 */
static void LCD_SendCommand(uint8_t comando){

	/*Aislar el nibble alto (bits 7-4)*/
	uint8_t nibble_alto = comando & 0xF0;		//0xF0 = 11110000

	/*Aislar el nibble bajo (bits 3-0) y desplazarlo a la posición alta*/
	uint8_t nibble_bajo = (comando << 4) & 0xF0;

	/*Envío de ambos nibbles como comando (RS = 0)*/
	LCD_SendNibble(nibble_alto, LCD_COMANDO);
	LCD_SendNibble(nibble_bajo, LCD_COMANDO);

}


/*
 * LCD_SendData
 * Traduce un byte completo en 2 llamadas de 4 bits cada una
 * Se trata de caracteres a dibujar
 */
static void LCD_SendData(uint8_t caracter){

	/*Aislar el nibble alto (bits 7-4)*/
	uint8_t nibble_alto = caracter & 0xF0;

	/*Aislar el nibble bajo (bits 3-0) y desplazarlo a la posición alta*/
	uint8_t nibble_bajo = (caracter << 4) & 0xF0;

	/*Envío de ambos nibbles como dato (RS = 1)*/
	LCD_SendNibble(nibble_alto, LCD_DATO);
	LCD_SendNibble(nibble_bajo, LCD_DATO);

}


/*
 * LCD_Init
 * Ejecuta la secuencia de inicialización del HD44780 en modo 4 bits,
 * Se siguen las instrucciones dadas en el datasheet (Initializing by Instruction)
 * Debe llamarse una sola vez, antes de usar cualquier otra función del driver.
 * Después de los 3 envíos de 0x30 se lleva al modo 8 bits (Esperando el primer nibble de una nueva instrucción)
 */
static void LCD_Init(void){

	/*Espera inicial tras energizar (datasheet exige minimo 15 ms desde VCC estable, con margen)*/
	HAL_Delay(20);

	/*Primer envío de 0x30 (aun no se puede usar LCD_SendCommand, el LCD no sabe que esta en modo 4 bits)*/
	LCD_SendNibble(0x30, LCD_COMANDO);		//0x30 = 00110000
	HAL_Delay(5);							//Se pide esperar más de 4.1 ms

	/*Segundo envío de 0x30*/
	LCD_SendNibble(0x30, LCD_COMANDO);
	HAL_Delay(1);		//Se pide esperar más de 100 us

	/*Tercer envío de 0x30*/
	LCD_SendNibble(0x30, LCD_COMANDO);
	HAL_Delay(1);

	/*Cambio a modo 4 bits*/
	LCD_SendNibble(0x20, LCD_COMANDO);		//0x20 = 00010000 (DB4 en 0 lo pone en modo de 4 bits)
	HAL_Delay(1);

	/*Function set: 4 bits (DL = 0), 2 lineas (N = 1) y fuente 5x8 (F = 0)*/
	LCD_SendCommand(0x28);		//0x28 = 01001000

	/*Display off: Display apagado (D = 0), cursor apagado (C = 0) y blink apagado (B = 0)*/
	LCD_SendCommand(0x08);		//0x28 = 00001000

	/*Display clear: Borra toda la DDRAM y regresa el cursor a la posicion 0*/
	LCD_SendCommand(0x01);		//0x01 = 00000001
	HAL_Delay(2);				//Esta es una operacion interna lenta, requiere espera adicional

	/*Entry mode set: Incrementa el cursor automaticamente (I/D = 1) y sin desplazamiento de pantalla (S = 0)*/
	LCD_SendCommand(0x06);		//0x06 = 00000110

	/*Display on: Display encendido (D = 1), cursor apagado (C = 0) y blink apagado (B = 0)*/
	LCD_SendCommand(0x0C);		//0x0C = 00001100

}


/*
 * LCD_SetCursor
 * Posiciona el cursor en una fila (0-3) y columna (0-19) especifica
 * Usa las direcciones base de cada linea segun el mapa DDRAM del datasheet
 */
static void LCD_SetCursor(uint8_t fila, uint8_t columna){

	uint8_t direccion;		//Dirección = address línea + # de columna

	switch(fila){

		case 0:

			direccion = LCD_LINE1 + columna;

			break;

		case 1:

			direccion = LCD_LINE2 + columna;

			break;

		case 2:

			direccion = LCD_LINE3 + columna;

			break;

		case 3:

			direccion = LCD_LINE4 + columna;

			break;

		default:

			direccion = LCD_LINE1 + columna;

			break;		//Va a la línea 1 en caso de llamar a una fila diferente de 0 a 3

	}

	/*Envío de al dirección con el comando Set DDRAM address*/
	LCD_SendCommand(0x80 | direccion);		//0x80 = 10000000

}


/*
 * LCD_Print
 * Escribe una cadena de texto completa a partir de la posicion actual del cursor,
 * Envía cada caracter con LCD_SendData()
 */
static void LCD_Print(char *texto){

	while(*texto != '\0'){

		LCD_SendData((uint8_t)(*texto));

		texto++;

	}

}



/*
 * usart2_Init
 * Configuración de pines físicos como función alternada para la comunicación serial
 * 19200 8N1
 */
static void usart2_Init(void){

	/*Configuración de los pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_Init_Tx = {0};
	GPIO_InitTypeDef GPIO_Init_Rx = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA2 y PA3 */
	GPIO_Init_Tx.Pin	   = GPIO_PIN_2;
	GPIO_Init_Tx.Mode 	   = GPIO_MODE_AF_PP;			//Establece los pines en modo función alternativa
	GPIO_Init_Tx.Pull  	   = GPIO_NOPULL;				//Desactiva resistencias de Pull-Up o Pull-Down
	GPIO_Init_Tx.Speed	   = GPIO_SPEED_FREQ_HIGH;		//Configuración de velocidad como alta
	GPIO_Init_Tx.Alternate = GPIO_AF7_USART2;			//Función alternativa correspondiente a AF7 en USART2

	GPIO_Init_Rx.Pin	   = GPIO_PIN_3;
	GPIO_Init_Rx.Mode 	   = GPIO_MODE_AF_PP;			//Establece los pines en modo función alternativa
	GPIO_Init_Rx.Pull  	   = GPIO_PULLUP;				//Activa resistencia Pull-Up interna para evitar estados flotantes
	GPIO_Init_Rx.Speed	   = GPIO_SPEED_FREQ_HIGH;		//Configuración de velocidad como alta
	GPIO_Init_Rx.Alternate = GPIO_AF7_USART2;			//Función alternativa correspondiente a AF7 en USART2

	/*Cargar la configuración en los registros FSR del MCU*/
	HAL_GPIO_Init(GPIOA, &GPIO_Init_Tx);
	HAL_GPIO_Init(GPIOA, &GPIO_Init_Rx);

	/*Configuración del USART2*/
	/*Habilitar reloj de TIM2 en el bus APB1*/
	__HAL_RCC_USART2_CLK_ENABLE();

	/*Configuración general del USART2*/
	huart2.Instance          = USART2;
	huart2.Init.BaudRate     = 19200;
	huart2.Init.Mode         = UART_MODE_TX_RX;			//Establece modo de transmisión (Tx) y recepción (Rx)
	huart2.Init.Parity       = UART_PARITY_NONE;		//Sin paridad
	huart2.Init.StopBits     = UART_STOPBITS_1;			//1 bit de parada
	huart2.Init.WordLength   = UART_WORDLENGTH_8B;		//8 bits de datos

	/*Cargar la configuración en los registros FSR del MCU*/
	HAL_UART_Init(&huart2);

	/*Registrando la interrupción en el NVIC para la recepción*/
	HAL_NVIC_EnableIRQ(USART2_IRQn);

	/*Habilitar la interrupción para la recepción de datos*/
	HAL_UART_Receive_IT(&huart2, (uint8_t *) &rx_data, 1);		//El dato se guarda en la variable rx_data de a byte

