sovelasquezf/stm32-course-sovelasquezf/Sophia_Velasquez_TallerV/Src/Parcial.c
}


/*
 * rtc_Init
 * Configura el RTC interno usando el LSE (32.768kHz) como fuente de reloj
 * Prescalers calculados para llegar a 1Hz: 32768 / 128 / 256 = 1Hz
 */
static void rtc_Init(void){

	/*Seleccionar LSE como fuente de reloj del RTC*/
	__HAL_RCC_RTC_CONFIG(RCC_RTCCLKSOURCE_LSE);

	/*Habilitar reloj de RTC en el bus APB1*/
	__HAL_RCC_RTC_ENABLE();

	/*Configuracion general del RTC*/
	hrtc.Instance            = RTC;
	hrtc.Init.HourFormat     = RTC_HOURFORMAT_24;
	hrtc.Init.AsynchPrediv   = 128 - 1;							//Divisor asincrono: 32768 Hz / 128 = 256 Hz
	hrtc.Init.SynchPrediv    = 256 - 1;							//Divisor sincrono: 256 Hz / 256 = 1 Hz
	hrtc.Init.OutPut         = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;

	/*Inicializacion*/
	HAL_RTC_Init(&hrtc);

}


/*
 * rtc_Set
 * Configura hora y fecha solamente la primera vez que arranca el RTC
 * Se usa un registro de backup alimentado por la bateria conectada a VBAT
 * Debe tenerse en cuenta la "contraseña" para la inicialización del RTC
 */
static void rtc_Initial_Setting(void){

	/*Inicialización de estructuras*/
	RTC_TimeTypeDef RTC_Time = {0};
	RTC_DateTypeDef RTC_Date = {0};

	/*Verificar si el RTC ya fue inicializado antes*/
	if (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != RTC_BACKUP_PSW){		//Si la contraseña es la misma sigue contando normalmente, de lo contrario se inicializa nuevamente

		/*Configuración inicial de la hora, se usa como referencia*/
		RTC_Time.Hours   = 12;
		RTC_Time.Minutes = 0;
		RTC_Time.Seconds = 0;

		/*Cargando la configuración en los registros FSR del MCU*/
		HAL_RTC_SetTime(&hrtc, &RTC_Time, RTC_FORMAT_BIN);

		/*Configuración inicial de la fecha, se usa como referencia*/
		RTC_Date.WeekDay = RTC_WEEKDAY_MONDAY;
		RTC_Date.Month   = RTC_MONTH_JULY;
		RTC_Date.Date    = 27;
		RTC_Date.Year    = 26;

		/*Cargando la configuración en los registros FSR del MCU*/
		HAL_RTC_SetDate(&hrtc, &RTC_Date, RTC_FORMAT_BIN);

		/*Se guarda en el registro de backup la contraseña*/
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, RTC_BACKUP_PSW);

	}
}


/*
 * mco1_Init
 * Configura el MCO1 como salida para leer el HSI, LSE o PLL (Según se requiera) en PA8
 */
static void mco1_Init(void){

	/*Configuración de los pines*/
	/*Inicialización de estructuras*/
	GPIO_InitTypeDef GPIO_mco1_Init = {0};

	/*Habilitar reloj de GPIOA en el bus AHB1*/
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configuración general de los pines: PA8*/
	GPIO_mco1_Init.Pin	     = GPIO_PIN_8;
	GPIO_mco1_Init.Mode 	 = GPIO_MODE_AF_PP;				//Establece los pines en modo función alternativa
	GPIO_mco1_Init.Pull  	 = GPIO_NOPULL;					//Desactiva resistencias de Pull-Up o Pull-Down
	GPIO_mco1_Init.Speed	 = GPIO_SPEED_FREQ_VERY_HIGH;	//Configuración de velocidad como muy alta para evitar distorsiones
	GPIO_mco1_Init.Alternate = GPIO_AF0_MCO;					//Función alternativa correspondiente a AF0 en MCO1

	/*Cargar la configuracion en los registros FSR del MCU*/
	HAL_GPIO_Init(GPIOA, &GPIO_mco1_Init);

	/*Inicialización del MCO1*/
	HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_1);		//Se redirige la señal del Oscilador Interno de Alta Velocidad (HSI) a PA8

}


/*
 * HAL_TIM_PeriodElapsedCallback
 * Llamado automáticamente por HAL_TIM_IRQHandler() cada vez que un evento de actualización del timer se dispara
 * Es compartido por todos los timers (Siempre verifica htim->Instance)
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){

    if(htim->Instance == TIM11){

        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1);

    }
}


/*
 * HAL_ADC_ConvCpltCallback
 * Callback de la conversión ADC
 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){

	if(hadc->Instance == ADC1){

		if(adc_secuence == 0){

			raw_adc_x = HAL_ADC_GetValue(hadc);

			adc_secuence = 1;

		}

	else{

			raw_adc_y = HAL_ADC_GetValue(hadc);

			adc_secuence = 0;

		}

	}

}




